In [1]:
import numpy as np
import pandas as pd

In [2]:
srs = pd.Series(np.arange(1, 50, 4))
srs

0      1
1      5
2      9
3     13
4     17
5     21
6     25
7     29
8     33
9     37
10    41
11    45
12    49
dtype: int64

In [3]:
srs[1]

np.int64(5)

In [4]:
data = {
    "Name": ["John", "Jim", "Carrie", "Morris"],
    "Gender": ["M", "F", "M", "M"],
    "Profession": ["Athlete", "Tech", "Cricketer", "Actor"]
}

df = pd.DataFrame(data)
df

     Name Gender Profession
0    John      M    Athlete
1     Jim      F       Tech
2  Carrie      M  Cricketer
3  Morris      M      Actor

In [5]:
from pathlib import Path
path = Path().joinpath("..", "data", 'titanic.csv')
titanic = pd.read_csv(path)
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     10 non-null     int64
 1   pclass       10 non-null     int64
 2   sex          10 non-null     object
 3   age          8 non-null      float64
 4   sibsp        10 non-null     int64
 5   parch        10 non-null     int64
 6   fare         10 non-null     float64
 7   embarked     10 non-null     object
 8   class        10 non-null     object
 9   adult_male   10 non-null     bool
 10  embark_town  10 non-null     object
 11  pclass_1     10 non-null     int64
 12  price        10 non-null     float64
 13  gender       10 non-null     object
dtypes: bool(1), float64(3), int64(5), object(5)
memory usage: 1.2+ KB

In [6]:
cars = pd.read_csv(path.parent.joinpath('mtcars.csv'), index_col=0)
cars.info()

<class 'pandas.core.frame.DataFrame'>
Index: 32 entries, Mazda RX4 to Volvo 142E
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mpg     32 non-null     float64
 1   cyl     32 non-null     int64
 2   disp    32 non-null     float64
 3   hp      32 non-null     int64
 4   drat    32 non-null     float64
 5   wt      32 non-null     float64
 6   qsec    32 non-null     float64
 7   vs      32 non-null     int64
 8   am      32 non-null     int64
 9   gear    32 non-null     int64
 10  carb    32 non-null     int64
dtypes: float64(5), int64(6)
memory usage: 3.0+ KB

In [7]:
sales = pd.read_csv(path.parent.joinpath('sales.csv'))
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   StockCode    1067371 non-null  object
 2   Description  1062989 non-null  object
 3   Quantity     1067371 non-null  int64
 4   InvoiceDate  1067371 non-null  object
 5   Price        1067371 non-null  float64
 6   Customer ID  824364 non-null   float64
 7   Country      1067371 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 65.1+ MB

In [8]:
sales.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [9]:
# Find the Invoice number and Customer ID of the highest amount of purchase based on the given Sales data?
# Setup 1:
sales["Total_amount"] = sales['Quantity'] * sales['Price']

In [26]:
# Step 2:
invoice_sales = sales.groupby(["Invoice", "Customer ID"])["Total_amount"].sum().reset_index()
invoice_sales.head()

  Invoice  Customer ID  Total_amount
0  489434      13085.0        505.30
1  489435      13085.0        145.80
2  489436      13078.0        630.33
3  489437      15362.0        310.75
4  489438      18102.0       2286.24

In [12]:
max_purchase = invoice_sales.loc[invoice_sales["Total_amount"].idxmax()]

In [13]:
invoice_number = max_purchase["Invoice"]
customer_id = max_purchase["Customer ID"]
invoice_number, customer_id

('581483', np.float64(16446.0))

In [22]:
invoice_sales["Total_amount"].idxmax()

36942

In [23]:
invoice_sales["Total_amount"].max()

np.float64(168469.6)

In [29]:
data = {
    'Invoice': [489434, 489435, 489436, 489437, 489438, 489439, 489440, 489441, 489442, 489443],
    'Customer ID': [13085.0, 13085.0, 13078.0, 15362.0, 18102.0, 12682.0, 18087.0, 18087.0, 13635.0, 14110.0],
    'Total_amount': [505.30, 145.80, 630.33, 310.75, 2286.24, 426.30, 50.40, 344.34, 382.37, 285.06]
}

df = pd.DataFrame(data)
df

   Invoice  Customer ID  Total_amount
0   489434      13085.0        505.30
1   489435      13085.0        145.80
2   489436      13078.0        630.33
3   489437      15362.0        310.75
4   489438      18102.0       2286.24
5   489439      12682.0        426.30
6   489440      18087.0         50.40
7   489441      18087.0        344.34
8   489442      13635.0        382.37
9   489443      14110.0        285.06

In [28]:
df['Total_amount'].max()

np.float64(2286.24)